<?php

namespace App\Http\Requests;

use Illuminate\Foundation\Http\FormRequest;

class JobratingRequest extends FormRequest
{
    /**
     * Determine if the user is authorized to make this request.
     *
     * @return bool
     */
    public function authorize()
    {
        return true;
    }

    /**
     * Get the validation rules that apply to the request.
     *
     * @return array
     */
    public function rules()
    {
        return [
            'npipl' => 'required|max:1|',
            'nfabc' => 'required|max:1',
            'nfbc' => 'required|max:1',
            'nab_c' => 'required|max:1',
            'nfgps' => 'required|max:1',
            'nfvr' => 'required|max:1',
            'npvr' => 'required|max:1',
            'nfpara' => 'required|max:1',
            'nppara' => 'required|max:1',
            'nffeld' => 'required|max:1',
            'npfeld' => 'required|max:1',
            'stv5_7' => 'required|max:1',
            'stv5_7_2' => 'required|max:1',
            'stv7_10' => 'required|max:1',
            'stv7_10_1' => 'required|max:1',
            'stv10' => 'required|max:1',
            'stv10_pr' => 'required|max:1',
            'stf5_7' => 'required|max:1',
            'stf5_7_2' => 'required|max:1',
            'stf7_10' => 'required|max:1',
            'stf7_10_1' => 'required|max:1',
            'stf10' => 'required|max:1',
            'stf10_pr' => 'required|max:1',
            't11' => 'required|max:1',
            't12' => 'required|max:1',
            't21' => 'required|max:1',
            't22' => 'required|max:1',
            'nfv' => 'required|max:1',
            'nv' => 'required|max:1',
            'nfav' => 'required|max:1',
            'nfl0' => 'required|max:1',
            'nfl1' => 'required|max:1',
            'nfpv' => 'required|max:1',
            'nop' => 'required|max:1',
            'npr' => 'required|max:1'

        ];
    }

    public function messages()
    {
        return [
            'npipl.required' => 'ТТЁ хизмати таркибий бўлинмасига бириктирилган ҳудуддаги аҳоли сони киритилмаган',
            'nfabc.required' => 'Таҳлил даврида хизматда бўлган махсус автомобиллар сони киритилмаган',
            'nfbc.required' => 'Таҳлил даврида хизматда бўлган Реанимобил (HUNDAY)лар сони киритилмаган',
            'nab_c.required' => 'Таҳлил даврида хизматда бўлган  мобил+планшетлар сони киритилмаган',
            'nfgps.required' => 'Таҳлил даврида бор бўлган GPS*трекерлар сони киритилмаган',
            'nfvr.required' => 'Банд врач ставкалар сони киритилмаган',
            'npvr.required' => 'Штат нормативи бўйича врач ставкалари сони киритилмаган',
            'nfpara.required' => 'Банд парамедик ставкалари сони киритилмаган',
            'nppara.required' => 'Штат нормативи бўйича парамедик ставкалари сони киритилмаган',
            'nffeld.required' => 'Банд фельдшер ставкалари сони киритилмаган',
            'npfeld.required' => 'Штат нормативи бўйича фельдшер ставкалари сони киритилмаган',
            'stv5_7.required' => 'Стажи 5 йилга тенг ёки ошиқ, лекин 7 йилдан кам врачлар сони киритилмаган',
            'stv5_7_2.required' => 'Стажи 5 йилга тенг ёки ошиқ, лекин 7 йилдан кам врачлар ичида 2-тоифалилар сони киритилмаган',
            'stv7_10.required' => 'Стажи 7 йилга тенг ёки ошиқ, лекин 10 йилдан кам врачлар сони киритилмаган',
            'stv7_10_1.required' => 'Стажи 7 йилга тенг ёки ошиқ, лекин 10 йилдан кам врачлар ичида 1-тоифалилар сони киритилмаган',
            'stv10.required' => 'Стажи 10 йилга тенг ёки ошиқ бўлган врачлар сони киритилмаган',
            'stv10_pr.required' => 'Стажи 10йилга тенг ёки ошиқ врачлар ичида олий-тоифалилар сони киритилмаган',
            'stf5_7.required' => 'Стажи 5 йилга тенг ёки ошиқ, лекин 7 йилдан кам фельдшерлар сони киритилмаган',
            'stf5_7_2.required' => 'Стажи 5 йилга тенг ёки ошиқ, лекин 7 йилдан кам фельдшерлар ичида 2-тоифалилар сони киритилмаган',
            'stf7_10.required' => 'Стажи 7 йилга тенг ёки ошиқ, лекин 10 йилдан кам фельдшерлар сони киритилмаган',
            'stf7_10_1.required' => 'Стажи 7 йилга тенг ёки ошиқ, лекин 10 йилдан кам фельдшерлар ичида 1-тоифалилар сони киритилмаган',
            'stf10.required' => 'Стажи 10 йилга тенг ёки ошиқ бўлган фельдшерлар сони киритилмаган',
            'stf10_pr.required' => 'Стажи 10йилга тенг ёки ошиқ фелдшерлар ичида олий-тоифалилар сони киритилмаган',
            't11.required' => 'Тез тиббий ёрдам машинаси жўнатилган шошилинч чақирувлар бўйича ўртача вақт киритилмаган',
            't12.required' => 'Тез тиббий ёрдам машинаси жўнатилган Зудликни талаб этувчи ва кечиктирилмайдиган чақирувлар бўйича ўртача вақт киритилмаган',
            't21.required' => 'Беморнинг олдига етиб келишга кетган шошилинч чақирувлар ўртача вақт киритилмаган',
            't22.required' => 'Беморнинг олдига етиб келишга кетган Зудликни талаб этувчи ва кечиктирилмайдиган чақирувлар бўйича ўртача вақт киритилмаган',
            'nfv.required' => 'Тез тиббий ёрдам бригадасига бир суткада тушган ўртача юклама киритилмаган',
            'nv.required' => 'Баҳолаш давридаги барча чақирувлар сони киритилмаган',
            'nfav.required' => 'Асоссиз чақирувлар сони киритилмаган',
            'nfl0.required' => 'Тез тиббий ёрдам келгунга қадар ўлимлар сони киритилмаган',
            'nfl1.required' => 'Тез тиббий ёрдам бригадаси борлигида ўлимлар сони киритилмаган',
            'nfpv.required' => 'Такрорий чақирувлар сони киритилмаган',
            'nop.required' => 'Чақирувлар ҳақида амбулатор поликлиника муассасаларини хабардор этишлар сони киритилмаган',
            'npr.required' => 'Даволаш профилактика муассасаларининг даъволари ва фуқаролар шикоятлари сони киритилмаган'

        ];
    }
}
